Revit 2027 API
BuiltInFailures.MEPCalculationFailures.NetworkUnderConstrained Property
 The network is under constrained. You may specify the design flow value in the missing branches, or cap the open ends.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NetworkUnderConstrained { get; }
Public Shared ReadOnly Property NetworkUnderConstrained As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NetworkUnderConstrained {
	FailureDefinitionId^ get ();
}
static member NetworkUnderConstrained : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace